Repository: humblefoundation-zz/translation-support-files
Catalog: quran-imported/Muhsin Khan.tmx
Source language: ar
Languages: en

source: ولولا فضل الله عليك ورحمته لهمت طائفة منهم أن يضلوك وما يضلون إلا أنفسهم وما يضرونك من شيء وأنزل الله عليك الكتاب والحكمة وعلمك ما لم تكن تعلم وكان فضل الله عليك عظيما
en: Had not the Grace of Allah and His Mercy been upon you (O Muhammad صلى الله عليه وسلم), a party of them would certainly have made a decision to mislead you, but (in fact) they mislead none except their own selves, and no harm can they do to you in the least. Allah has sent down to you the Book (The Qur'an), and Al-Hikmah (Islamic laws, knowledge of legal and illegal things i.e. the Prophet's Sunnah - legal ways), and taught you that which you knew not. And Ever Great is the Grace of Allah unto you (O Muhammad صلى الله عليه وسلم).

source: لا خير في كثير من نجواهم إلا من أمر بصدقة أو معروف أو إصلاح بين الناس ومن يفعل ذلك ابتغاء مرضات الله فسوف نؤتيه أجرا عظيما
en: There is no good in most of their secret talks save (in) him who orders Sadaqah (charity in Allah's Cause), or Ma'ruf (Islamic Monotheism and all the good and righteous deeds which Allah has ordained), or conciliation between mankind; and he who does this, seeking the good Pleasure of Allah, We shall give him a great reward.

source: ومن يشاقق الرسول من بعد ما تبين له الهدى ويتبع غير سبيل المؤمنين نوله ما تولى ونصله جهنم وساءت مصيرا
en: And whoever contradicts and opposes the Messenger (Muhammad صلى الله عليه وسلم) after the right path has been shown clearly to him, and follows other than the believers' way, We shall keep him in the path he has chosen, and burn him in Hell - what an evil destination!

source: إن الله لا يغفر أن يشرك به ويغفر ما دون ذلك لمن يشاء ومن يشرك بالله فقد ضل ضلالا بعيدا
en: Verily! Allah forgives not (the sin of) setting up partners (in worship) with Him, but He forgives whom He wills sins other than that, and whoever sets up partners in worship with Allah, has indeed strayed far away.

source: إن يدعون من دونه إلا إناثا وإن يدعون إلا شيطانا مريدا
en: They (all those who worship others than Allah) invoke nothing but female deities besides Him (Allah), and they invoke nothing but Shaitan (Satan), a persistent rebel!

source: لعنه الله وقال لأتخذن من عبادك نصيبا مفروضا
en: Allah cursed him. And he [Shaitan (Satan)] said: "I will take an appointed portion of your slaves.

source: ولأضلنهم ولأمنينهم ولآمرنهم فليبتكن آذان الأنعام ولآمرنهم فليغيرن خلق الله ومن يتخذ الشيطان وليا من دون الله فقد خسر خسرانا مبينا
en: Verily, I will mislead them, and surely, I will arouse in them false desires; and certainly, I will order them to slit the ears of cattle, and indeed I will order them to change the nature created by Allah." And whoever takes Shaitan (Satan) as a Wali (protector or helper) instead of Allah, has surely suffered a manifest loss.

source: يعدهم ويمنيهم وما يعدهم الشيطان إلا غرورا
en: He [Shaitan (Satan)] makes promises to them, and arouses in them false desires; and Shaitan's (Satan) promises are nothing but deceptions.

source: أولئك مأواهم جهنم ولا يجدون عنها محيصا
en: The dwelling of such (people) is Hell, and they will find no way of escape from it.

source: والذين آمنوا وعملوا الصالحات سندخلهم جنات تجري من تحتها الأنهار خالدين فيها أبدا وعد الله حقا ومن أصدق من الله قيلا
en: But those who believe (in the Oneness of Allah - Islamic Monotheism) and do deeds of righteousness, We shall admit them to the Gardens under which rivers flow (i.e. in Paradise) to dwell therein forever. Allah's Promise is the Truth; and whose words can be truer than those of Allah? (Of course, none).

source: ليس بأمانيكم ولا أماني أهل الكتاب من يعمل سوءا يجز به ولا يجد له من دون الله وليا ولا نصيرا
en: It will not be in accordance with your desires (Muslims), nor those of the people of the Scripture (Jews and Christians), whosoever works evil, will have the recompense thereof, and he will not find any protector or helper besides Allah.

source: ومن يعمل من الصالحات من ذكر أو أنثى وهو مؤمن فأولئك يدخلون الجنة ولا يظلمون نقيرا
en: And whoever does righteous good deeds, male or female, and is a (true) believer [in the Oneness of Allah (Muslim)], such will enter Paradise and not the least injustice, even to the size of a speck on the back of a date-stone, will be done to them.

source: ومن أحسن دينا ممن أسلم وجهه لله وهو محسن واتبع ملة إبراهيم حنيفا واتخذ الله إبراهيم خليلا
en: And who can be better in religion than one who submits his face (himself) to Allah (i.e. follows Allah's religion of Islamic Monotheism); and he is a Muhsin (a good-doer - See V.2:112). And follows the religion of Ibrahim (Abraham) Hanifa (Islamic Monotheism - to worship none but Allah Alone). And Allah did take Ibrahim (Abraham) as a Khalil (an intimate friend)!

source: ولله ما في السماوات وما في الأرض وكان الله بكل شيء محيطا
en: And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever Encompassing all things.

source: ويستفتونك في النساء قل الله يفتيكم فيهن وما يتلى عليكم في الكتاب في يتامى النساء اللاتي لا تؤتونهن ما كتب لهن وترغبون أن تنكحوهن والمستضعفين من الولدان وأن تقوموا لليتامى بالقسط وما تفعلوا من خير فإن الله كان به عليما
en: They ask your legal instruction concerning women, say: Allah instructs you about them, and about what is recited unto you in the Book concerning the orphan girls whom you give not the prescribed portions (as regards Mahr and inheritance) and yet whom you desire to marry, and (concerning) the children who are weak and oppressed, and that you stand firm for justice to orphans. And whatever good you do, Allah is Ever All-Aware of it.

source: وإن امرأة خافت من بعلها نشوزا أو إعراضا فلا جناح عليهما أن يصلحا بينهما صلحا والصلح خير وأحضرت الأنفس الشح وإن تحسنوا وتتقوا فإن الله كان بما تعملون خبيرا
en: And if a woman fears cruelty or desertion on her husband's part, there is no sin on them both if they make terms of peace between themselves; and making peace is better. And human inner-selves are swayed by greed. But if you do good and keep away from evil, verily, Allah is Ever Well-Acquainted with what you do.

source: ولن تستطيعوا أن تعدلوا بين النساء ولو حرصتم فلا تميلوا كل الميل فتذروها كالمعلقة وإن تصلحوا وتتقوا فإن الله كان غفورا رحيما
en: You will never be able to do perfect justice between wives even if it is your ardent desire, so do not incline too much to one of them (by giving her more of your time and provision) so as to leave the other hanging (i.e. neither divorced nor married). And if you do justice, and do all that is right and fear Allah by keeping away from all that is wrong, then Allah is Ever Oft-Forgiving, Most Merciful.

source: وإن يتفرقا يغن الله كلا من سعته وكان الله واسعا حكيما
en: But if they separate (by divorce), Allah will provide abundance for everyone of them from His Bounty. And Allah is Ever All-Sufficient for His creatures' need, All-Wise.

source: ولله ما في السماوات وما في الأرض ولقد وصينا الذين أوتوا الكتاب من قبلكم وإياكم أن اتقوا الله وإن تكفروا فإن لله ما في السماوات وما في الأرض وكان الله غنيا حميدا
en: And to Allah belongs all that is in the heavens and all that is in the earth. And verily, We have recommended to the people of the Scripture before you, and to you (O Muslims) that you (all) fear Allah, and keep your duty to Him. But if you disbelieve, then unto Allah belongs all that is in the heavens and all that is in the earth, and Allah is Ever Rich (Free of all wants), Worthy of all praise.

source: ولله ما في السماوات وما في الأرض وكفى بالله وكيلا
en: And to Allah belongs all that is in the heavens and all that is in the earth. And Allah is Ever All-Sufficient as Disposer of affairs.

source: إن يشأ يذهبكم أيها الناس ويأت بآخرين وكان الله على ذلك قديرا
en: If He wills, He can take you away, O people, and bring others. And Allah is Ever All-Potent over that.

source: من كان يريد ثواب الدنيا فعند الله ثواب الدنيا والآخرة وكان الله سميعا بصيرا
en: Whoever desires a reward in this life of the world, then with Allah (Alone and none else) is the reward of this worldly life and of the Hereafter. And Allah is Ever All-Hearer, All-Seer.

source: يا أيها الذين آمنوا كونوا قوامين بالقسط شهداء لله ولو على أنفسكم أو الوالدين والأقربين إن يكن غنيا أو فقيرا فالله أولى بهما فلا تتبعوا الهوى أن تعدلوا وإن تلووا أو تعرضوا فإن الله كان بما تعملون خبيرا
en: O you who believe! Stand out firmly for justice, as witnesses to Allah, even though it be against yourselves, or your parents, or your kin, be he rich or poor, Allah is a Better Protector to both (than you). So follow not the lusts (of your hearts), lest you avoid justice; and if you distort your witness or refuse to give it, verily, Allah is Ever Well-Acquainted with what you do.

source: يا أيها الذين آمنوا آمنوا بالله ورسوله والكتاب الذي نزل على رسوله والكتاب الذي أنزل من قبل ومن يكفر بالله وملائكته وكتبه ورسله واليوم الآخر فقد ضل ضلالا بعيدا
en: O you who believe! Believe in Allah, and His Messenger (Muhammad صلى الله عليه وسلم), and the Book (the Qur'an) which He has sent down to His Messenger, and the Scripture which He sent down to those before (him); and whosoever disbelieves in Allah, His Angels, His Books, His Messengers, and the Last Day, then indeed he has strayed far away.

source: إن الذين آمنوا ثم كفروا ثم آمنوا ثم كفروا ثم ازدادوا كفرا لم يكن الله ليغفر لهم ولا ليهديهم سبيلا
en: Verily, those who believe, then disbelieve, then believe (again), and (again) disbelieve, and go on increasing in disbelief; Allah will not forgive them, nor guide them on the (Right) Way.

source: بشر المنافقين بأن لهم عذابا أليما
en: Give to the hypocrites the tidings that there is for them a painful torment.

source: الذين يتخذون الكافرين أولياء من دون المؤمنين أيبتغون عندهم العزة فإن العزة لله جميعا
en: Those who take disbelievers for Auliya' (protectors or helpers or friends) instead of believers, do they seek honour, power and glory with them? Verily, then to Allah belongs all honour, power and glory.

source: وقد نزل عليكم في الكتاب أن إذا سمعتم آيات الله يكفر بها ويستهزأ بها فلا تقعدوا معهم حتى يخوضوا في حديث غيره إنكم إذا مثلهم إن الله جامع المنافقين والكافرين في جهنم جميعا
en: And it has already been revealed to you in the Book (this Qur'an) that when you hear the Verses of Allah being denied and mocked at, then sit not with them, until they engage in a talk other than that; (but if you stayed with them) certainly in that case you would be like them. Surely, Allah will collect the hypocrites and disbelievers all together in Hell.

source: الذين يتربصون بكم فإن كان لكم فتح من الله قالوا ألم نكن معكم وإن كان للكافرين نصيب قالوا ألم نستحوذ عليكم ونمنعكم من المؤمنين فالله يحكم بينكم يوم القيامة ولن يجعل الله للكافرين على المؤمنين سبيلا
en: Those (hypocrites) who wait and watch about you; if you gain a victory from Allah, they say: "Were we not with you?" But if the disbelievers gain a success, they say (to them): "Did we not gain mastery over you and did we not protect you from the believers?" Allah will judge between you (all) on the Day of Resurrection. And never will Allah grant to the disbelievers a way (to triumph) over the believers.

source: إن المنافقين يخادعون الله وهو خادعهم وإذا قاموا إلى الصلاة قاموا كسالى يراءون الناس ولا يذكرون الله إلا قليلا
en: Verily, the hypocrites seek to deceive Allah, but it is He Who deceives them. And when they stand up for As-Salat (the prayer), they stand with laziness and to be seen of men, and they do not remember Allah but little.

source: مذبذبين بين ذلك لا إلى هؤلاء ولا إلى هؤلاء ومن يضلل الله فلن تجد له سبيلا
en: (They are) swaying between this and that, belonging neither to these nor to those; and he whom Allah sends astray, you will not find for him a way (to the truth - Islam).

source: يا أيها الذين آمنوا لا تتخذوا الكافرين أولياء من دون المؤمنين أتريدون أن تجعلوا لله عليكم سلطانا مبينا
en: O you who believe! Take not for Auliya' (protectors or helpers or friends) disbelievers instead of believers. Do you wish to offer Allah a manifest proof against yourselves?

source: إن المنافقين في الدرك الأسفل من النار ولن تجد لهم نصيرا
en: Verily, the hypocrites will be in the lowest depth (grade) of the Fire; no helper will you find for them.

source: إلا الذين تابوا وأصلحوا واعتصموا بالله وأخلصوا دينهم لله فأولئك مع المؤمنين وسوف يؤت الله المؤمنين أجرا عظيما
en: Except those who repent (from hypocrisy), do righteous good deeds, hold fast to Allah, and purify their religion for Allah (by worshipping none but Allah, and do good for Allah's sake only, not to show off), then they will be with the believers. And Allah will grant the believers a great reward.

source: ما يفعل الله بعذابكم إن شكرتم وآمنتم وكان الله شاكرا عليما
en: Why should Allah punish you if you have thanked (Him) and have believed in Him. And Allah is Ever All-Appreciative (of good), All-Knowing.

source: لا يحب الله الجهر بالسوء من القول إلا من ظلم وكان الله سميعا عليما
en: Allah does not like that the evil should be uttered in public except by him who has been wronged. And Allah is Ever All-Hearer, All-Knower.

source: إن تبدوا خيرا أو تخفوه أو تعفوا عن سوء فإن الله كان عفوا قديرا
en: Whether you (mankind) disclose (by good words of thanks) a good deed (done to you in the form of a favour by someone), or conceal it, or pardon an evil, ... verily, Allah is Ever Oft-Pardoning, All-Powerful.

source: إن الذين يكفرون بالله ورسله ويريدون أن يفرقوا بين الله ورسله ويقولون نؤمن ببعض ونكفر ببعض ويريدون أن يتخذوا بين ذلك سبيلا
en: Verily, those who disbelieve in Allah and His Messengers and wish to make distinction between Allah and His Messengers (by believing in Allah and disbelieving in His Messengers) saying, "We believe in some but reject others," and wish to adopt a way in between.

source: أولئك هم الكافرون حقا وأعتدنا للكافرين عذابا مهينا
en: They are in truth disbelievers. And We have prepared for the disbelievers a humiliating torment.

source: والذين آمنوا بالله ورسله ولم يفرقوا بين أحد منهم أولئك سوف يؤتيهم أجورهم وكان الله غفورا رحيما
en: And those who believe in Allah and His Messengers and make no distinction between any of them (Messengers), We shall give them their rewards; and Allah is Ever Oft-Forgiving, Most Merciful.

source: يسألك أهل الكتاب أن تنزل عليهم كتابا من السماء فقد سألوا موسى أكبر من ذلك فقالوا أرنا الله جهرة فأخذتهم الصاعقة بظلمهم ثم اتخذوا العجل من بعد ما جاءتهم البينات فعفونا عن ذلك وآتينا موسى سلطانا مبينا
en: The people of the Scripture (Jews) ask you to cause a book to descend upon them from heaven. Indeed they asked Musa (Moses) for even greater than that, when they said: "Show us Allah in public," but they were struck with thunderclap and lightning for their wickedness. Then they worshipped the calf even after clear proofs, evidence, and signs had come to them. (Even) so We forgave them. And We gave Musa (Moses) a clear proof of authority.

source: ورفعنا فوقهم الطور بميثاقهم وقلنا لهم ادخلوا الباب سجدا وقلنا لهم لا تعدوا في السبت وأخذنا منهم ميثاقا غليظا
en: And for their covenant, We raised over them the Mount and (on the other occasion) We said: "Enter the gate prostrating (or bowing) with humility;" and We commanded them: "Transgress not (by doing worldly works) on the Sabbath (Saturday)." And We took from them a firm covenant .

source: فبما نقضهم ميثاقهم وكفرهم بآيات الله وقتلهم الأنبياء بغير حق وقولهم قلوبنا غلف بل طبع الله عليها بكفرهم فلا يؤمنون إلا قليلا
en: Because of their breaking the covenant, and of their rejecting the Ayat (proofs, evidence, verses, lessons, signs, revelations, etc.) of Allah, and of their killing the Prophets unjustly, and of their saying: "Our hearts are wrapped (with coverings, i.e. we do not understand what the Messengers say)" - nay, Allah has set a seal upon their hearts because of their disbelief, so they believe not but a little.

source: وبكفرهم وقولهم على مريم بهتانا عظيما
en: And because of their (Jews) disbelief and uttering against Maryam (Mary السلام عليهما) a grave false charge (that she has committed illegal sexual intercourse);

source: وقولهم إنا قتلنا المسيح عيسى ابن مريم رسول الله وما قتلوه وما صلبوه ولكن شبه لهم وإن الذين اختلفوا فيه لفي شك منه ما لهم به من علم إلا اتباع الظن وما قتلوه يقينا
en: And because of their saying (in boast), "We killed Messiah 'Îsa (Jesus), son of Maryam (Mary), the Messenger of Allah," - but they killed him not, nor crucified him, but it appeared so to them [the resemblance of 'Îsa (Jesus) was put over another man (and they killed that man)], and those who differ therein are full of doubts. They have no (certain) knowledge, they follow nothing but conjecture. For surely; they killed him not [i.e. 'Îsa (Jesus), son of Maryam (Mary) عليهما السلام]:

source: بل رفعه الله إليه وكان الله عزيزا حكيما
en: But Allah raised him ['Îsa (Jesus)] up (with his body and soul) unto Himself (and he عليه السلام is in the heavens). And Allah is Ever All-Powerful, All-Wise.

source: وإن من أهل الكتاب إلا ليؤمنن به قبل موته ويوم القيامة يكون عليهم شهيدا
en: And there is none of the people of the Scripture (Jews and Christians) but must believe in him ['Îsa (Jesus), son of Maryam (Mary), as only a Messenger of Allah and a human being] before his ['Îsa (Jesus) عليه السلام) or a Jew's or a Christian's] death (at the time of the appearance of the angel of death). And on the Day of Resurrection, he ['Îsa (Jesus)] will be a witness against them.

source: فبظلم من الذين هادوا حرمنا عليهم طيبات أحلت لهم وبصدهم عن سبيل الله كثيرا
en: For the wrong-doing of the Jews, We made unlawful for them certain good foods which had been lawful for them - and for their hindering many from Allah's Way;

source: وأخذهم الربا وقد نهوا عنه وأكلهم أموال الناس بالباطل وأعتدنا للكافرين منهم عذابا أليما
en: And their taking of Riba (usury) though they were forbidden from taking it and their devouring of men's substance wrongfully (bribery). And We have prepared for the disbelievers among them a painful torment.

source: لكن الراسخون في العلم منهم والمؤمنون يؤمنون بما أنزل إليك وما أنزل من قبلك والمقيمين الصلاة والمؤتون الزكاة والمؤمنون بالله واليوم الآخر أولئك سنؤتيهم أجرا عظيما
en: But those among them who are well-grounded in knowledge, and the believers, believe in what has been sent down to you (Muhammad صلى الله عليه وسلم) and what was sent down before you; and those who perform As-Salat (Iqamat-as-Salat ), and give Zakat and believe in Allah and in the Last Day, it is they to whom We shall give a great reward.

source: إنا أوحينا إليك كما أوحينا إلى نوح والنبيين من بعده وأوحينا إلى إبراهيم وإسماعيل وإسحاق ويعقوب والأسباط وعيسى وأيوب ويونس وهارون وسليمان وآتينا داوود زبورا
en: Verily, We have sent the revelation to you (O Muhammad صلى الله عليه وسلم) as We sent the revelation to Nuh (Noah) and the Prophets after him; We (also) sent the revelation to Ibrahim (Abraham), Isma'il (Ishmael), Ishaq (Isaac), Ya'qub (Jacob), and Al-Asbat [the offspring of the twelve sons of Ya'qub (Jacob)], 'Îsa (Jesus), Ayyub (Job), Yunus (Jonah), Harun (Aaron), and Sulaiman (Solomon); and to Dawud (David) We gave the Zabur (Psalms).

source: ورسلا قد قصصناهم عليك من قبل ورسلا لم نقصصهم عليك وكلم الله موسى تكليما
en: And Messengers We have mentioned to you before, and Messengers We have not mentioned to you, - and to Musa (Moses) Allah spoke directly.

source: رسلا مبشرين ومنذرين لئلا يكون للناس على الله حجة بعد الرسل وكان الله عزيزا حكيما
en: Messengers as bearers of good news as well as of warning in order that mankind should have no plea against Allah after the (coming of) Messengers. And Allah is Ever All-Powerful, All-Wise.

source: لكن الله يشهد بما أنزل إليك أنزله بعلمه والملائكة يشهدون وكفى بالله شهيدا
en: But Allah bears witness to that which He has sent down (the Qur'an) unto you (O Muhammad صلى الله عليه وسلم); He has sent it down with His Knowledge, and the angels bear witness. And Allah is All-Sufficient as a Witness.

source: إن الذين كفروا وصدوا عن سبيل الله قد ضلوا ضلالا بعيدا
en: Verily, those who disbelieve [by concealing the truth about Prophet Muhammad صلى الله عليه وسلم and his message of true Islamic Monotheism written in the Taurat (Torah) and the Injeel (Gospel) with them] and prevent (mankind) from the Path of Allah (Islamic Monotheism); they have certainly strayed far away. (Tafsir Al-Qurtubi).

source: إن الذين كفروا وظلموا لم يكن الله ليغفر لهم ولا ليهديهم طريقا
en: Verily, those who disbelieve and did wrong [by concealing the truth about Prophet Muhammad صلى الله عليه وسلم and his message of true Islamic Monotheism written in the Taurat (Torah) and the Injeel (Gospel) with them]; Allah will not forgive them, nor will He guide them to any way - (Tafsir Al-Qurtubi).

source: إلا طريق جهنم خالدين فيها أبدا وكان ذلك على الله يسيرا
en: Except the way of Hell, to dwell therein forever; and this is ever easy for Allah.

source: يا أيها الناس قد جاءكم الرسول بالحق من ربكم فآمنوا خيرا لكم وإن تكفروا فإن لله ما في السماوات والأرض وكان الله عليما حكيما
en: O mankind! Verily, there has come to you the Messenger (Muhammad صلى الله عليه وسلم) with the truth from your Lord. So believe in him, it is better for you. But if you disbelieve, then certainly to Allah belongs all that is in the heavens and the earth. And Allah is Ever All-Knowing, All-Wise.

source: يا أهل الكتاب لا تغلوا في دينكم ولا تقولوا على الله إلا الحق إنما المسيح عيسى ابن مريم رسول الله وكلمته ألقاها إلى مريم وروح منه فآمنوا بالله ورسله ولا تقولوا ثلاثة انتهوا خيرا لكم إنما الله إله واحد سبحانه أن يكون له ولد له ما في السماوات وما في الأرض وكفى بالله وكيلا
en: O people of the Scripture (Christians)! Do not exceed the limits in your religion, nor say of Allah aught but the truth. The Messiah 'Îsa (Jesus), son of Maryam (Mary), was (no more than) a Messenger of Allah and His Word, ("Be!" - and he was) which He bestowed on Maryam (Mary) and a spirit (Ruh ) created by Him; so believe in Allah and His Messengers. Say not: "Three (trinity)!" Cease! (it is) better for you. For Allah is (the only) One Ilah (God), glory be to Him (Far Exalted is He) above having a son. To Him belongs all that is in the heavens and all that is in the earth. And Allah is All-Sufficient as a Disposer of affairs.

source: لن يستنكف المسيح أن يكون عبدا لله ولا الملائكة المقربون ومن يستنكف عن عبادته ويستكبر فسيحشرهم إليه جميعا
en: The Messiah will never be proud to reject to be a slave to Allah, nor the angels who are the near (to Allah). And whosoever rejects His worship and is proud, then He will gather them all together unto Himself.

source: فأما الذين آمنوا وعملوا الصالحات فيوفيهم أجورهم ويزيدهم من فضله وأما الذين استنكفوا واستكبروا فيعذبهم عذابا أليما ولا يجدون لهم من دون الله وليا ولا نصيرا
en: So, as for those who believed (in the Oneness of Allah - Islamic Monotheism) and did deeds of righteousness, He will give them their (due) rewards - and more out of His Bounty. But as for those who refused His worship and were proud, He will punish them with a painful torment. And they will not find for themselves besides Allah any protector or helper.

source: يا أيها الناس قد جاءكم برهان من ربكم وأنزلنا إليكم نورا مبينا
en: O mankind! Verily, there has come to you a convincing proof (Prophet Muhammad صلى الله عليه وسلم) from your Lord; and We sent down to you a manifest light (this Qur'an).

source: فأما الذين آمنوا بالله واعتصموا به فسيدخلهم في رحمة منه وفضل ويهديهم إليه صراطا مستقيما
en: So, as for those who believed in Allah and held fast to Him, He will admit them to His Mercy and Grace (i.e. Paradise), and guide them to Himself by the Straight Path.
